tap "argoproj/tap", trusted: true
tap "aws/tap", trusted: true
tap "fluxcd/tap", trusted: true
tap "github/gh", trusted: true
tap "gobuffalo/tap", trusted: true
tap "homebrew/bundle"
tap "homebrew/services"
tap "knative-extensions/kn-plugins", trusted: true
tap "peonping/tap", "https://github.com/PeonPing/homebrew-tap", trusted: true
tap "siderolabs/tap", trusted: true
tap "spacedriveapp/tap", trusted: true
tap "stripe/stripe-cli", trusted: true
tap "ubuntu/microk8s", trusted: true
tap "vapor/tap", trusted: true
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Library for command-line editing
brew "readline"
# Advanced Forensic Format
brew "afflib"
# Creates self documenting CLI programs from commands in YAML files
brew "ahoy"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# File and directory integrity checker
brew "aide"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GNU compiler collection
brew "gcc"
# LLVM's OpenMP runtime library
brew "libomp"
# YAML Parser
brew "libyaml"
# Optimized BLAS library
brew "openblas"
# AI pair programming in your terminal
brew "aider"
# Asynchronous DNS library
brew "c-ares"
# Portable Foreign Function Interface library
brew "libffi"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Angular
brew "angular-cli"
# NaCl networking and cryptography library
brew "libsodium"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# All in one for **env
brew "anyenv"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Message bus system, providing inter-application communication
brew "dbus"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Configuration editing tool and API
brew "augeas"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Uses macOS keychain for storage of AWS credentials
brew "aws-keychain"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Command-line tool for interacting with the balenaCloud and balena API
brew "balena-cli"
# Text-based UI library
brew "ncurses"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Implementation of the Actor Model for C++
brew "caf"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Callback framework for C++
brew "libsigc++"
# Vector graphics library with cross-device output support
brew "cairomm"
# Callback framework for C++
brew "libsigc++@2"
# Cargo subcommand to easily use LLVM source-based code coverage
brew "cargo-llvm-cov"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# C++ template library for linear algebra
brew "eigen"
# Computational Geometry Algorithms Library
brew "cgal"
# CLI for managing secrets through AWS SSM Parameter Store
brew "chamber"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Check Java source against a coding standard
brew "checkstyle"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Command-line tool for Amazon Route 53
brew "cli53"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Long term storage for Prometheus
brew "cortex"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Reimplementation of ctags(1)
brew "ctags"
# Top-like interface for container metrics
brew "ctop"
# Computes the SHA1 hash of schema and content of a SQLite database
brew "dbhash"
# Kubernetes command-line interface
brew "kubernetes-cli"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# Interpreter for the Dhall language
brew "dhall"
# Compile Dhall to Bash
brew "dhall-bash"
# Dhall to JSON compiler and a Dhall to YAML compiler
brew "dhall-json"
# Language Server Protocol (LSP) server for Dhall
brew "dhall-lsp-server"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# Recursive piecewise hashing tool
brew "ssdeep"
# Test domains for typo squatting, phishing and corporate espionage
brew "dnstwist"
# Standard XML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Tools for browsing and manipulating docker registries
brew "docker-ls"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Docker image squashing tool
brew "docker-squash"
# Replay stored shell commands for live presentations
brew "doitlive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Launch process with environment variables from Consul and Vault
brew "envconsul"
# AST-based pattern checker for JavaScript
brew "eslint"
# Command-line tool to interact with exercism.io
brew "exercism"
# XML 1.0 parser
brew "expat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# H.265/HEVC encoder
brew "x265"
# Fully featured Firefox Send client
brew "ffsend"
# Implementation of the file(1) command
brew "libmagic"
# Utility to determine file types
brew "file-formula"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Command-line tool for the fn project
brew "fn"
# Library for manipulating fonts
brew "fonttools"
# HTTP and gRPC load testing and visualization tool and server
brew "fortio"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line utility to control a phone
brew "gammu"
# GNU awk utility
brew "gawk"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Asynchronous event library
brew "libev"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Modern asynchronous DNS API
brew "getdns"
# Library for processing command-line flags
brew "gflags"
# GitHub command-line tool
brew "gh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Secure hashing function
brew "libb2"
# Multi-format archive and compression library
brew "libarchive"
# International domain name library
brew "libidn"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Command-line option parsing utility
brew "gnu-getopt"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Audit git repos for secrets
brew "gitleaks"
# Simplified version control system on top of git
brew "gitless"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Application-level logging library
brew "glog"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golang-migrate"
# Extremely memory-efficient hash_map implementation
brew "google-sparsehash"
# WSDL2Go code generation as well as its SOAP proxy
brew "gowsdl"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Fallback theme for FreeDesktop.org icon themes
brew "hicolor-icon-theme"
# Library for handling OpenGL function pointer management
brew "libepoxy"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Package for scientific computing with Python
brew "numpy"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Like cURL, but for gRPC
brew "grpcurl"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Self-improving AI agent that creates skills from experience
brew "hermes-agent"
# Perl compatible regular expressions library
brew "pcre"
# Packet capture and analysis utility similar to tcpdump for HTTP
brew "httpflow"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# AWS IAM import and export tool
brew "iamy"
# Open h.265 video codec implementation
brew "libde265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Time series, events, and metrics database
brew "influxdb"
# String tool
brew "intltool"
# Interactive computing in Python
brew "ipython"
# International Ispell
brew "ispell"
# Istio configuration command-line utility
brew "istioctl"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Configure Jenkins jobs with YAML files stored in Git
brew "jenkins-job-builder"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for JSON, based on GLib
brew "json-glib"
# Library for interacting with JSON
brew "jsoncpp"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Command-line JSON pretty-printer
brew "jsonpp"
# Swiss-army knife of markup format conversion
brew "pandoc"
# High-performance, asynchronous messaging library
brew "zeromq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Package manager for kubectl plugins
brew "krew"
# Helps audit your Kubernetes clusters against common security controls
brew "kubeaudit"
# Manage complex enterprise Kubernetes environments as code
brew "kubecfg"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Tools for observing Kubernetes resources in realtime
brew "kubespy"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Let's Encrypt client and ACME library
brew "lego"
# Build tool for Clojure
brew "leiningen"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# ELF object file access library
brew "libelf"
# Library for support of the Expert Witness Compression Format
brew "libewf"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# USB multiplexor library for iOS devices
brew "libusbmuxd"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Keccak-family hashing library
brew "libkeccak"
# C/C++ seam carving library
brew "liblqr"
# Data compression library
brew "lzlib"
# Apache Kafka C/C++ library
brew "librdkafka"
# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"
# Library to Access SMI MIB Information
brew "libsmi"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Library for USB device access
brew "libusb-compat"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Command-line utility to interact with linkerd
brew "linkerd"
# Implementation of IEEE 802.1ab (LLDP)
brew "lldpd"
# Python generator for the console
brew "lorem"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Security and system auditing tool to harden systems
brew "lynis"
# Securely transfers data between computers
brew "magic-wormhole"
# Creates dependencies in makefiles
brew "makedepend"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Multiple Arcade Machine Emulator
brew "mame"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Show markdown documents on text terminals
brew "mdcat"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Powerful markdown processor in Go geared towards the IETF
brew "mmark"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Cross platform, open source .NET development framework
brew "mono"
# Mass parallel ssh
brew "mpssh"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Multi-host SSH wrapper
brew "mussh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# FTP client with an advanced user interface
brew "ncftp"
# Command-line collection runner for Postman
brew "newman"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Powerful programming language and shell designed specifically for Ops
brew "ngs"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Package manager for Microsoft development platform including .NET
brew "nuget"
# Manage multiple Node.js versions
brew "nvm"
# Seamless operability between C++11 and Python
brew "pybind11"
# Compression/decompression library aiming for high speed
brew "snappy"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Spec-driven development (SDD) for AI coding assistants
brew "openspec"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Turn any webpage into a desktop app with Rust with ease
brew "pake"
# Shell command parallelization utility
brew "parallel"
# Efficient rsh-like utility, for using hosts in parallel
brew "pdsh"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Display the PID number for a given process name
brew "pidof"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Print the IP addresses in a given range
brew "prips"
# Modern replacement for ps written in Rust
brew "procs"
# Linter for prose
brew "proselint"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Protocol buffers library
brew "protobuf-c"
# Unix pager optimized for psql
brew "pspg"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# GNU Portable THreads
brew "pth"
# Password generator
brew "pwgen"
# Pythonic task management & command execution
brew "pyinvoke"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Rakudo compiler and commonly used packages
brew "rakudo-star"
# JSON parser/generator for C++ with SAX and DOM style APIs
brew "rapidjson"
# Rsync for cloud storage
brew "rclone"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Persistent key-value database, with built-in net interface
brew "redis"
# Interpreter for Rexx
brew "regina-rexx"
# Edit version-control repository history
brew "reposurgeon"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Embeddable, persistent key-value store for fast storage
brew "rocksdb"
# Tools for Multiple Arcade Machine Emulator
brew "rom-tools"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Install various Ruby versions and implementations
brew "ruby-build"
# Library for creating multi-platform software
brew "s-lang"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Command-line Interface for Scaleway
brew "scw"
# Intuitive find & replace CLI
brew "sd"
# SDL2 graphics drawing primitives and other support functions
brew "sdl2_gfx"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Small sample cross-platform networking library
brew "sdl2_net"
# Abstract soundfile decoder for SDL
brew "sdl2_sound"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Build applications with serverless architectures
brew "serverless"
# Library and Utilities for zeroconf networking
brew "servus"
# Keccak, SHA-3, SHAKE, and RawSHAKE checksum utilities
brew "sha3sum"
# Reversible directory-local environment variable manipulations
brew "shadowenv"
# Database of common MIME types
brew "shared-mime-info"
# Autoformat shell script source code
brew "shfmt"
# Execute the same command on many hosts in parallel
brew "shmux"
# CLI and dbus interface for WhisperSystems/libsignal-service-java
brew "signal-cli"
# Command-line utility for posting snippets to Slack
brew "slackcat"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Generate Markdown files from inline source code documentation
brew "sourcedocs"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Analyze how space is allocated inside an SQLite file
brew "sqlite-analyzer"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Compressed read-only file system for Linux
brew "squashfs"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# SSL tunneling program
brew "stunnel"
# Process Control System
brew "supervisor"
# Swift toolchain installer and manager
brew "swiftly"
# Tool to detect and prevent secrets from getting checked in
brew "talisman"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Plugin-driven server agent for collecting & reporting metrics
brew "telegraf", restart_service: :changed
# Tool to build, change, and version infrastructure
brew "terraform"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform Language Server
brew "terraform-ls"
# Improve Terraform's plan output
brew "terraform_landscape"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform automation and orchestration tool
brew "terrahub"
# Linter for Terraform files
brew "tflint"
# Framework for scalable cross-language services development
brew "thrift"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Upgrade all the things
brew "topgrade"
# Lightweight BitTorrent client
brew "transmission-cli"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Expose local servers to the internet securely
brew "tunnel"
# Language for application scale JavaScript development
brew "typescript"
# Extraction utility for .zip compressed archives
brew "unzip"
# URI parsing library (strictly RFC 3986 compliant)
brew "uriparser"
# Bash completion for Vagrant
brew "vagrant-completion"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Convert bootable DMG images for use in VMware Fusion
brew "vfuse"
# Transparently read from and write to zip, bzip2, lzma or zstd archives
brew "wandio"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark", link: false
# OpenWhisk Command-Line Interface (CLI)
brew "wsk"
# Translate common Internet acronyms
brew "wtf"
# Personal information dashboard for your terminal
brew "wtfutil"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Validating XML parser
brew "xerces-c"
# XML command-line utilities
brew "xmlstarlet"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Yet Another Dotfiles Manager
brew "yadm"
# Yet Another JSON Library
brew "yajl"
# Linter for YAML files
brew "yamllint"
# Malware identification and classification tool
brew "yara"
# View colored diff with side by side and auto pager support
brew "ydiff"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Network security monitor
brew "zeek"
# NoSQL query processor
brew "zorba"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# HTTP and WebSocket client worker with ZeroMQ interface
brew "zurl"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Flux CLI
brew "fluxcd/tap/flux"
brew "gobuffalo/tap/buffalo"
brew "knative-extensions/kn-plugins/func"
# Sound effects and desktop notifications for AI coding agents
brew "peonping/tap/peon-ping"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
brew "vapor/tap/ctls"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Image editor focused on simplicity
cask "acorn"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Dungeon exploration game
cask "angband-app"
# Chromium based browser
cask "arc"
# Two-factor authentication software
cask "authy"
# Data backup and storage service
cask "backblaze"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
# Online gaming platform
cask "battle-net"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Menu bar app for monitoring AI coding assistant usage quotas
cask "claudebar"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Native document editor
cask "craft"
# Tool to run Windows software
cask "crossover"
# Disk space visualiser
cask "daisydisk"
# Peer to peer data sharing app built for humans
cask "dat"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-runtime"
# Sync DriveThruRPG libraries to compatible devices
cask "drivethrurpg"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Tool to turn a website into a desktop app
cask "fluid"
cask "font-awesome-terminal-fonts"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono-pl"
cask "font-jetbrains-mono"
cask "font-meslo-for-powerlevel10k"
cask "font-source-code-pro"
# Kubernetes IDE
cask "freelens"
# 2D and 3D game engine
cask "godot"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Quick Look plugin for Jupyter notebooks
cask "jupyter-notebook-ql"
# Utility to render Jupyter notebooks
cask "jupyter-notebook-viewer"
# Lightweight download manager
cask "leech"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Tool to write, preview and publish blogs
cask "marsedit"
# Sandbox construction video game
cask "minecraft"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Multi-file renaming tool
cask "name-mangler"
# Free and open-source RSS reader
cask "netnewswire"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Batch image processor
cask "retrobatch"
# Word processing software with a typewriter style
cask "scrivener"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# Backup, recovery and cloning software
cask "superduper"
# Native GUI tool for relational databases
cask "tableplus"
# Markdown knowledgebase manager
cask "tolaria"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code@insiders"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Tool to run web apps like desktop apps
cask "webcatalog"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Mesh VPN client
cask "zerotier-one"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bible Study", id: 472790630
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Ping", id: 1532271726
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andrejunges.handlebars"
vscode "anthropic.claude-code"
vscode "bartmanabyss.amiga-debug"
vscode "batisteo.vscode-django"
vscode "bbenoist.shell"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bigmodelingtools.erdiagram"
vscode "bmarkovic.haproxy"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "caarlos0.language-prometheus"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.ssh"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "coolbear.systemd-unit-file"
vscode "cssho.vscode-svgviewer"
vscode "cstrap.flask-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "davidwang.ini-for-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dineug.vuerd-vscode"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.jquerysnippets"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "egomobile.vscode-powertools"
vscode "elmtooling.elm-ls-vscode"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "first-try-software.coverage-status"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "gamunu.vscode-yarn"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "greggu.prometheus-client-python-snippets"
vscode "gruntfuggly.renumber-selection"
vscode "harshpaliwal.argocd-gitops"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hilleer.yaml-plus-json"
vscode "ipedrazas.kubernetes-snippets"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "jscearcy.rust-doc-viewer"
vscode "k--kato.intellij-idea-keybindings"
vscode "kdcro101.vscode-redis"
vscode "kenhowardpdx.vscode-gist"
vscode "kevinrose.vsc-python-indent"
vscode "koihik.vscode-lua-format"
vscode "kortina.run-in-terminal"
vscode "labocho.chmod-command"
vscode "lehni.vscode-titlebar-less-macos"
vscode "lkytal.flatui"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "loganarnett.lambda-snippets"
vscode "lokalise.i18n-ally"
vscode "lorenzopirro.rust-flash-snippets"
vscode "lqyld.vscode-icons-iconify"
vscode "makeoptim.istio-snippets"
vscode "mark-tucker.aws-cli-configure"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mikeshaker.python-essentials"
vscode "mikestead.dotenv"
vscode "minecraftcommands.syntax-mcfunction"
vscode "misterj.vue-volar-extention-pack"
vscode "mkloubert.vscode-remote-workspace"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-modernize"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.anaconda-extension-pack"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.theme-markdownkit"
vscode "mtxr.sqltools"
vscode "nextfaze.json-parse-stringify"
vscode "njpwerner.autodocstring"
vscode "noxiz.jinja-snippets"
vscode "olback.bar"
vscode "onecrayon.theme-quietlight-vsc"
vscode "openai.chatgpt"
vscode "oscartbeaumont.rspc-vscode"
vscode "pamaron.pytest-runner"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "polymeilex.rust-targets"
vscode "prisma.prisma"
vscode "raynigon.nginx-formatter"
vscode "redhat.java"
vscode "redhat.vscode-knative"
vscode "redhat.vscode-tekton-pipelines"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "richie5um2.vscode-statusbar-json-path"
vscode "ritwickdey.liveserver"
vscode "robinbentley.sass-indented"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.edit-with-shell"
vscode "samuelcolvin.jinjahtml"
vscode "satoren.lualint"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-zipexplorer"
vscode "spacek33z.vscode-open-in-gitfork"
vscode "steoates.autoimport"
vscode "sugatoray.jinja-extension-pack"
vscode "sumneko.lua"
vscode "suntobright.vscode-sftp"
vscode "svelte.svelte-vscode"
vscode "swellaby.rust-pack"
vscode "swiftlang.swift-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "thebarkman.vscode-djaneiro"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.selectline-statusbar"
vscode "trinm1709.dracula-theme-from-intellij"
vscode "tumido.crd-snippets"
vscode "vadimcn.vscode-lldb"
vscode "vapor.vapor-vscode"
vscode "viablelab.capitalize"
vscode "vmware.vscode-concourse"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
vscode "wscats.vue"
vscode "wyattferguson.jinja2-snippet-kit"
vscode "xabikos.javascriptsnippets"
vscode "zhangyue.rust-mod-generator"
vscode "zignd.html-css-class-completion"
cargo "bottom"
cargo "cargo-cache"
cargo "cargo-watch"
cargo "cargo-xtask"
cargo "create-gpui-app"
cargo "create-tauri-app"
cargo "grcov"
cargo "rustfilt"
cargo "rustlings"
cargo "spacebot"
cargo "tauri-cli"
krew "stern"
npm "nativefier"
npm "yarn"
