tap "aws/tap"
tap "derailed/popeye"
tap "fluxcd/tap"
tap "github/bootstrap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "vapor/tap"
brew "ack"
brew "act"
brew "adns"
brew "gdbm"
brew "readline"
brew "xz"
brew "afflib"
brew "ahoy"
brew "libgpg-error"
brew "libgcrypt"
brew "pcre"
brew "aide"
brew "anyenv"
brew "libpng"
brew "libtiff"
brew "openexr"
brew "webp"
brew "argo"
brew "argocd"
brew "gettext"
brew "pcre2"
brew "glib"
brew "libffi"
brew "atk"
brew "augeas"
brew "autoconf"
brew "automake"
brew "autossh"
brew "awscli"
brew "awslogs"
brew "bash-completion"
brew "bat"
brew "bazelisk"
brew "freetype"
brew "fontconfig"
brew "pkg-config"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "little-cms2"
brew "openjdk"
brew "bfg"
brew "lz4"
brew "zstd"
brew "boost"
brew "boost-python3"
brew "bottom"
brew "brigade-cli"
brew "broot"
brew "buildkit"
brew "c-ares"
brew "caddy"
brew "caf"
brew "libsigc++"
brew "cairomm"
brew "libsigc++@2"
brew "catimg"
brew "libyaml"
brew "cfn-lint"
brew "chamber"
brew "cheat"
brew "checkstyle"
brew "choose"
brew "chrome-cli"
brew "cmake"
brew "gmp"
brew "libtool"
brew "libunistring"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "libusb"
brew "ncurses"
brew "snappy"
brew "colima"
brew "copilot"
brew "coreutils"
brew "csvkit"
brew "ctags"
brew "ctop"
brew "libssh2"
brew "curl"
brew "curlie"
brew "dbhash"
brew "dbus"
brew "delta"
brew "go"
brew "dep"
brew "dependency-check"
brew "dhall"
brew "dhall-bash"
brew "dhall-json"
brew "dhall-lsp-server"
brew "dialog"
brew "diff-so-fancy"
brew "direnv"
brew "geoip"
brew "ssdeep"
brew "dnstwist"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "dog"
brew "doitlive"
brew "dos2unix"
brew "dosbox-x"
brew "duf"
brew "dust"
brew "e2fsprogs"
brew "ec2-api-tools"
brew "gflags"
brew "glog"
brew "editorconfig"
brew "elvish"
brew "envconsul"
brew "libuv"
brew "node"
brew "eslint"
brew "exa"
brew "exercism"
brew "expat"
brew "libsodium"
brew "fd"
brew "fribidi"
brew "jpeg", link: true
brew "openjpeg"
brew "libb2"
brew "libarchive"
brew "gobject-introspection"
brew "x265"
brew "zeromq"
brew "ffmpeg"
brew "ffsend"
brew "libmagic"
brew "file-formula"
brew "flex"
brew "fluxctl"
brew "fn"
brew "fonttools"
brew "fortio"
brew "fortune"
brew "fping"
brew "unixodbc"
brew "fswatch"
brew "fzf"
brew "gammu"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gd"
brew "gdk-pixbuf"
brew "gdm"
brew "geckodriver"
brew "libev"
brew "getdns"
brew "gh"
brew "libidn"
brew "ghostscript"
brew "git"
brew "git-credential-manager"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-lfs"
brew "libassuan"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "git-secret"
brew "gitleaks"
brew "libgit2"
brew "gitless"
brew "gitmoji"
brew "glances"
brew "glide"
brew "glooctl"
brew "gnu-sed"
brew "goenv"
brew "golang-migrate"
brew "google-sparsehash"
brew "gowsdl"
brew "gping"
brew "gradle"
brew "gradle-completion"
brew "jasper"
brew "netpbm"
brew "gts"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gron"
brew "grpcurl"
brew "gsettings-desktop-schemas"
brew "gssh"
brew "hicolor-icon-theme"
brew "gtk+"
brew "libepoxy"
brew "gtk+3"
brew "gtop"
brew "helm"
brew "http-parser"
brew "httpflow"
brew "httpie"
brew "httping"
brew "hub"
brew "hugo"
brew "hyperfine"
brew "ilmbase"
brew "libde265"
brew "xmlto"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp"
brew "imagemagick"
brew "imagemagick@6"
brew "intltool"
brew "ipython"
brew "ispell"
brew "istioctl"
brew "jansson"
brew "jemalloc"
brew "jo"
brew "oniguruma"
brew "jq"
brew "json-glib"
brew "jsoncpp"
brew "jsonnet"
brew "jsonpp"
brew "pandoc"
brew "jupyterlab"
brew "just"
brew "kompose"
brew "krb5"
brew "kubernetes-cli"
brew "krew"
brew "kubeaudit"
brew "kubecfg"
brew "kubecm"
brew "kubectx"
brew "kubeless"
brew "kubeprod"
brew "kubespy"
brew "kustomize"
brew "lego"
brew "leiningen"
brew "libcroco"
brew "libelf"
brew "libewf"
brew "libplist"
brew "libusbmuxd"
brew "libimobiledevice"
brew "libkeccak"
brew "libmaxminddb"
brew "libpq"
brew "lzlib"
brew "librdkafka"
brew "libressl"
brew "libsmi"
brew "unibilium"
brew "libtermkey"
brew "libusb-compat"
brew "libvterm"
brew "libzip"
brew "linkerd"
brew "linode-cli"
brew "llvm"
brew "lorem"
brew "lsd"
brew "lynis"
brew "magic-wormhole"
brew "makedepend"
brew "utf8proc"
brew "mame"
brew "mas"
brew "mcfly"
brew "mdcat"
brew "protobuf"
brew "mitmproxy"
brew "mkcert"
brew "mmark"
brew "mongosh"
brew "moreutils"
brew "mpssh"
brew "msgpack"
brew "mussh"
brew "mycli"
brew "zlib"
brew "mysql-client"
brew "ncftp"
brew "newman"
brew "nghttp2"
brew "nginx"
brew "ngs"
brew "nspr"
brew "nss"
brew "openblas"
brew "numpy"
brew "nvm"
brew "pybind11"
brew "ocrmypdf"
brew "openapi-generator"
brew "pkcs11-helper"
brew "openvpn"
brew "operator-sdk"
brew "packer"
brew "pdsh"
brew "perl"
brew "pgcli"
brew "pgformatter"
brew "php"
brew "pidof"
brew "popt"
brew "prips"
brew "procs"
brew "proselint"
brew "protobuf-c"
brew "prototool"
brew "pspg"
brew "pssh"
brew "pth"
brew "pulledpork"
brew "pwgen"
brew "py2cairo"
brew "py3cairo"
brew "pygobject3"
brew "pyinvoke"
brew "python@3.8"
brew "qt"
brew "qt@5"
brew "quicktype"
brew "rakudo-star"
brew "rapidjson"
brew "rclone"
brew "re2c"
brew "recutils"
brew "regina-rexx"
brew "reposurgeon"
brew "ripgrep"
brew "rke"
brew "rlwrap"
brew "rmlint"
brew "rom-tools"
brew "ruby"
brew "ruby-build"
brew "rust"
brew "s3cmd"
brew "scipy"
brew "scons"
brew "scw"
brew "sd"
brew "servus"
brew "sha3sum"
brew "shadowenv"
brew "shfmt"
brew "ship"
brew "shmux"
brew "signal-cli"
brew "slackcat"
brew "sleuthkit"
brew "socat"
brew "sops"
brew "sourcedocs"
brew "speedtest-cli"
brew "sphinx-doc"
brew "sqlite-analyzer"
brew "sqlmap"
brew "squashfs"
brew "sslscan"
brew "starship"
brew "step"
brew "stern"
brew "stormssh"
brew "stormssh-completion"
brew "stunnel"
brew "subversion"
brew "supervisor"
brew "talisman"
brew "tbb"
brew "telegraf"
brew "terraform"
brew "terraform-docs"
brew "terraform-ls"
brew "terraform_landscape"
brew "terraformer"
brew "terraforming"
brew "terragrunt"
brew "terrahub"
brew "tflint"
brew "the_silver_searcher"
brew "thrift"
brew "tldr"
brew "tmux"
brew "tmuxinator-completion"
brew "topgrade"
brew "trash"
brew "tunnel"
brew "ugrep"
brew "unzip"
brew "uriparser"
brew "velero"
brew "vfuse"
brew "wandio"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "wsk"
brew "wtf"
brew "wtfutil"
brew "wxwidgets"
brew "xerces-c"
brew "xh"
brew "xmlstarlet"
brew "xonsh"
brew "yadm"
brew "yajl"
brew "yamllint"
brew "yara"
brew "ydiff"
brew "yj"
brew "youtube-dl"
brew "yq"
brew "zeek"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zurl"
brew "derailed/popeye/popeye"
brew "fluxcd/tap/flux"
brew "stripe/stripe-cli/stripe"
brew "vapor/tap/ctls"
cask "1password"
cask "1password-cli"
cask "acorn"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alfred"
cask "authy"
cask "azure-data-studio"
cask "backblaze"
cask "backblaze-downloader"
cask "balenaetcher"
cask "battle-net"
cask "bbedit"
cask "bitwarden"
cask "brave-browser"
cask "cakebrew"
cask "daisydisk"
cask "dash"
cask "dat"
cask "discord"
cask "firefox"
cask "fluid"
cask "font-jetbrains-mono"
cask "font-liberation"
cask "font-unna"
cask "fork"
cask "gog-galaxy"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jupyter-notebook-ql"
cask "jupyter-notebook-viewer"
cask "leech"
cask "lens"
cask "little-snitch"
cask "logitech-options"
cask "mactex"
cask "marsedit"
cask "menuwhere"
cask "minecraft"
cask "netnewswire"
cask "ngrok"
cask "obs"
cask "obs-virtualcam"
cask "origin"
cask "oxygen-xml-editor"
cask "parallels"
cask "plex"
cask "postman"
cask "rectangle"
cask "scribus"
cask "scrivener"
cask "shotcut"
cask "signal"
cask "sketch"
cask "slack"
cask "ssh-tunnel-manager"
cask "steam"
cask "superduper"
cask "swiftbar"
cask "tableplus"
cask "texpad"
cask "transmission"
cask "transmit"
cask "visual-studio-code-insiders"
cask "vlc"
cask "wireshark"
cask "zerotier-one"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bible Study", id: 472790630
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "New File Menu", id: 1064959555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PaintCode", id: 808809998
mas "Spark", id: 1176895641
mas "Transporter", id: 1450874784
mas "xScope", id: 447661441
