tap "aws/tap"
tap "fluxcd/tap"
tap "github/gh"
tap "gobuffalo/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "ubuntu/microk8s"
tap "vapor/tap"
brew "ack"
brew "act"
brew "adns"
brew "readline"
brew "sqlite"
brew "xz"
brew "afflib"
brew "ahoy"
brew "gettext"
brew "libgpg-error"
brew "libgcrypt"
brew "pcre2"
brew "aide"
brew "c-ares"
brew "libuv"
brew "node"
brew "angular-cli"
brew "libsodium"
brew "libssh"
brew "libyaml"
brew "ansible"
brew "ansible-lint"
brew "anyenv"
brew "libpng"
brew "lz4"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "dbus"
brew "libunistring"
brew "glib"
brew "at-spi2-core"
brew "augeas"
brew "autoconf"
brew "automake"
brew "autossh"
brew "aws-keychain"
brew "aws-shell"
brew "awscli"
brew "awslogs"
brew "azure-cli"
brew "balena-cli"
brew "bash-completion"
brew "libssh2"
brew "libgit2"
brew "oniguruma"
brew "bat"
brew "freetype"
brew "fontconfig"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "boost"
brew "boost-python3"
brew "buildkit"
brew "caf"
brew "libsigc++"
brew "cairomm"
brew "libsigc++@2"
brew "cfn-lint"
brew "eigen"
brew "gmp"
brew "mpfr"
brew "cgal"
brew "chamber"
brew "checkstyle"
brew "chrome-cli"
brew "cli53"
brew "cmake"
brew "colima", restart_service: true
brew "curl"
brew "libtool"
brew "unixodbc"
brew "gd"
brew "krb5"
brew "libpq"
brew "libzip"
brew "composer"
brew "coreutils"
brew "cortex"
brew "csvkit"
brew "ctags"
brew "ctop"
brew "dbhash"
brew "dependency-check"
brew "kubernetes-cli"
brew "devspace"
brew "dhall"
brew "dhall-bash"
brew "dhall-json"
brew "dhall-lsp-server"
brew "dialog"
brew "diff-so-fancy"
brew "digdag"
brew "direnv"
brew "dive"
brew "libmaxminddb"
brew "ssdeep"
brew "dnstwist"
brew "docbook"
brew "docbook-xsl"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "docker-ls"
brew "docker-machine"
brew "docker-squash"
brew "doitlive"
brew "dos2unix"
brew "e2fsprogs"
brew "gflags"
brew "glog"
brew "libevent"
brew "snappy"
brew "editorconfig"
brew "envconsul"
brew "wxwidgets"
brew "erlang"
brew "eslint"
brew "exercism"
brew "expat"
brew "fd"
brew "fribidi"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "libb2"
brew "libarchive"
brew "pango"
brew "x265"
brew "zeromq"
brew "ffsend"
brew "libmagic"
brew "file-formula"
brew "firebase-cli"
brew "flex"
brew "fn"
brew "fonttools"
brew "fortio"
brew "fortune"
brew "fping"
brew "fswatch"
brew "gammu"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gdbm"
brew "gdk-pixbuf"
brew "geckodriver"
brew "geoip"
brew "libev"
brew "getdns"
brew "libidn"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-lfs"
brew "libassuan"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "git-secret"
brew "gitleaks"
brew "gitless"
brew "gitmoji"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "gnu-sed"
brew "pkg-config"
brew "gobject-introspection"
brew "golang-migrate"
brew "google-sparsehash"
brew "gowsdl"
brew "gradle"
brew "gradle-completion"
brew "hicolor-icon-theme"
brew "libepoxy"
brew "gtk+3"
brew "openblas"
brew "numpy"
brew "py3cairo"
brew "pygobject3"
brew "scipy"
brew "graph-tool"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "gron"
brew "grpcurl"
brew "gssh"
brew "gtk+"
brew "helm"
brew "helmfile"
brew "helmsman"
brew "pcre"
brew "httpflow"
brew "httpie"
brew "httping"
brew "hub"
brew "hugo"
brew "iamy"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp"
brew "imagemagick"
brew "imagemagick@6"
brew "influxdb"
brew "intltool"
brew "ipython"
brew "ispell"
brew "jansson"
brew "jemalloc"
brew "jenkins-job-builder"
brew "jpeg"
brew "jq"
brew "json-glib"
brew "jsoncpp"
brew "jsonnet"
brew "jsonpp"
brew "pandoc"
brew "jupyterlab"
brew "just"
brew "k3d"
brew "krew"
brew "kubeaudit"
brew "kubecfg"
brew "kubectx"
brew "kubespy"
brew "kubevela"
brew "kustomize"
brew "lego"
brew "leiningen"
brew "libcroco"
brew "libelf"
brew "libewf"
brew "libffi"
brew "libplist"
brew "libusbmuxd"
brew "libimobiledevice"
brew "libkeccak"
brew "lzlib"
brew "librdkafka"
brew "libressl"
brew "libsmi"
brew "unibilium"
brew "libtermkey"
brew "libusb-compat"
brew "libvterm"
brew "linkerd"
brew "lldpd"
brew "lorem"
brew "luajit"
brew "lynis"
brew "magic-wormhole"
brew "makedepend"
brew "utf8proc"
brew "mame"
brew "mas"
brew "mcfly"
brew "mdcat"
brew "mkcert"
brew "mmark"
brew "mongodb-atlas-cli"
brew "mono"
brew "mpssh"
brew "msgpack"
brew "mussh"
brew "mycli"
brew "zlib"
brew "mysql-client"
brew "ncftp"
brew "ncurses"
brew "protobuf"
brew "protobuf-c"
brew "netdata"
brew "newman"
brew "nghttp2"
brew "nginx"
brew "ngs"
brew "nspr"
brew "nss"
brew "nuget"
brew "nvm"
brew "pybind11"
brew "tbb"
brew "ocrmypdf"
brew "openapi-generator"
brew "openjdk@17"
brew "openssl@1.1"
brew "pkcs11-helper"
brew "openvpn"
brew "parallel"
brew "pdsh"
brew "perl"
brew "pgcli"
brew "pgformatter"
brew "pidof"
brew "pipx"
brew "popt"
brew "postgresql@14"
brew "powerlevel10k"
brew "prips"
brew "procs"
brew "proselint"
brew "pspg"
brew "pssh"
brew "pth"
brew "pwgen"
brew "pyinvoke"
brew "python@3.8"
brew "qt"
brew "quicktype"
brew "rakudo-star"
brew "rapidjson"
brew "rclone"
brew "re2c"
brew "redis"
brew "regina-rexx"
brew "reposurgeon"
brew "rlwrap"
brew "rmlint"
brew "rocksdb"
brew "rom-tools"
brew "ruby"
brew "ruby-build"
brew "s-lang"
brew "s3cmd"
brew "scons"
brew "scw"
brew "sd"
brew "serverless"
brew "servus"
brew "sha3sum"
brew "shadowenv"
brew "shfmt"
brew "shmux"
brew "slackcat"
brew "sleuthkit"
brew "socat"
brew "sops"
brew "sourcedocs"
brew "speedtest-cli"
brew "sphinx-doc"
brew "sqlite-analyzer"
brew "sqlmap"
brew "squashfs"
brew "sslscan"
brew "starship"
brew "step"
brew "stern"
brew "stunnel"
brew "supervisor"
brew "sysdig"
brew "talisman"
brew "telegraf", restart_service: true
brew "terraform"
brew "terraform-docs"
brew "terraform-ls"
brew "terraform_landscape"
brew "terraformer"
brew "terragrunt"
brew "terrahub"
brew "tflint"
brew "thrift"
brew "tmux"
brew "tmuxinator-completion"
brew "topgrade"
brew "transmission-cli"
brew "trash"
brew "tree"
brew "tunnel"
brew "typescript"
brew "unzip"
brew "uriparser"
brew "vagrant-completion"
brew "vapor"
brew "vault-cli"
brew "velero"
brew "vfuse"
brew "wandio"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "wireshark", link: false
brew "wsk"
brew "wtf"
brew "wtfutil"
brew "xerces-c"
brew "xmlstarlet"
brew "xmlto"
brew "xonsh"
brew "yadm"
brew "yajl"
brew "yamllint"
brew "yara"
brew "ydiff"
brew "yj"
brew "youtube-dl"
brew "yq"
brew "zeek"
brew "zorba"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zurl"
brew "fluxcd/tap/flux"
brew "gobuffalo/tap/buffalo"
brew "stripe/stripe-cli/stripe"
brew "vapor/tap/ctls"
cask "1password"
cask "1password-cli"
cask "acorn"
cask "adobe-acrobat-reader"
cask "alfred"
cask "angband"
cask "arc"
cask "authy"
cask "azure-data-studio"
cask "backblaze"
cask "balenaetcher"
cask "bartender"
cask "battle-net"
cask "bbedit"
cask "chatgpt"
cask "codeedit"
cask "crossover"
cask "daisydisk"
cask "dat"
cask "default-folder-x"
cask "discord"
cask "dotnet"
cask "drivethrurpg"
cask "dropbox"
cask "firefox"
cask "fluid"
cask "font-awesome-terminal-fonts"
cask "font-jetbrains-mono"
cask "font-meslo-for-powerlevel10k"
cask "gas-mask"
cask "google-chrome"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jupyter-notebook-ql"
cask "jupyter-notebook-viewer"
cask "leech"
cask "little-snitch"
cask "logi-options+"
cask "mactex"
cask "marsedit"
cask "mcedit"
cask "minecraft"
cask "mongodb-compass"
cask "name-mangler"
cask "netnewswire"
cask "ngrok"
cask "obsidian"
cask "openlens"
cask "postman"
cask "proxyman"
cask "rectangle"
cask "scrivener"
cask "smartsynchronize"
cask "ssh-tunnel-manager"
cask "steam"
cask "superduper"
cask "tableplus"
cask "transmission"
cask "transmit"
cask "visual-studio-code@insiders"
cask "vlc"
cask "warp"
cask "webcatalog"
cask "wireshark"
cask "zerotier-one"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bible Study", id: 472790630
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Ping", id: 1532271726
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
