acorn
adobe-acrobat-reader
adoptopenjdk
alt-tab
anki
authy
aws-vault
azure-data-studio
backblaze
balenaetcher
battle-net
bbedit
beaker-browser
bot-framework-emulator
brave-browser
cakebrew
dash
dat
discord
docker
dotnet
dropbox
emacs
epic-games
firefox
fluid
font-jetbrains-mono
funter
google-chrome
google-cloud-sdk
handbrake
istat-menus
iterm2
java
java11
jetbrains-toolbox
jupyter-notebook-ql
jupyter-notebook-viewer
keybase
kitematic
leech
lens
maccy
mactex
marsedit
mcedit
mono-mdk
moom
multipass
netnewswire
ngrok
obs
obs-virtualcam
obsidian
osxfuse
oxygen-xml-editor
postman
retrobatch
scrivener
shotcut
signal
sketch
slack
smartsynchronize
soundsource
sourcetree
spectacle
ssh-tunnel-manager
steam
strawberry
superduper
swiftformat-for-xcode
tagspaces
texpad
transmission
transmit
tunnelblick
unity
unity-hub
vagrant
virtualbox
virtualbox-extension-pack
visual-studio-code
visual-studio-code-insiders
vlc
waterfox-current
wireshark
zerotier-one
