tap "aws/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"
tap "ubuntu/microk8s"
tap "vapor/tap"
cask "osxfuse"
brew "ack"
brew "act"
brew "adns"
brew "gdbm"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.8"
brew "afflib"
brew "afuse"
brew "ahoy"
brew "libgpg-error"
brew "libgcrypt"
brew "pcre"
brew "aide"
brew "icu4c"
brew "node"
brew "angular-cli"
brew "libyaml"
brew "ansible"
brew "ansible-lint"
brew "argo"
brew "argocd"
brew "gettext"
brew "libffi"
brew "glib"
brew "atk"
brew "openjdk"
brew "atlassian-cli"
brew "augeas"
brew "autoconf"
brew "automake"
brew "autossh"
brew "ec2-api-tools"
brew "aws-cfn-tools"
brew "aws-elasticbeanstalk"
brew "aws-iam-authenticator"
brew "aws-keychain"
brew "aws-shell"
brew "awscli"
brew "awslogs"
brew "azure-cli"
brew "balena-cli"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "bindfs"
brew "boost"
brew "boost-python3"
brew "buildkit"
brew "c-ares"
brew "caf"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "lzo"
brew "pixman"
brew "cairo"
brew "libsigc++@2"
brew "cairomm"
brew "catimg"
brew "cfn-lint"
brew "eigen"
brew "gmp"
brew "mpfr"
brew "cgal"
brew "chamber"
brew "checkstyle"
brew "chrome-cli"
brew "cli53"
brew "cloud-watch"
brew "cmake"
brew "cocoapods"
brew "composer"
brew "consul"
brew "copilot"
brew "coreutils"
brew "cortex"
brew "csvkit"
brew "ctags"
brew "ctop"
brew "curl"
brew "dbhash"
brew "dbus"
brew "go"
brew "dep"
brew "dependency-check"
brew "kubernetes-cli", link: false
brew "devspace"
brew "dhall"
brew "dhall-bash"
brew "dhall-json"
brew "dhall-lsp-server"
brew "dialog"
brew "diff-so-fancy"
brew "digdag"
brew "direnv"
brew "dive"
brew "geoip"
brew "ssdeep"
brew "dnstwist"
brew "docbook"
brew "docbook-xsl"
brew "docker", link: false
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-credential-helper-ecr"
brew "docker-ls"
brew "docker-machine"
brew "docker-machine-driver-hyperkit"
brew "docker-machine-driver-xhyve"
brew "docker-squash"
brew "doitlive"
brew "dos2unix"
brew "e2fsprogs"
brew "pcre2"
brew "editorconfig"
brew "eject"
brew "eksctl"
brew "jpeg"
brew "libtiff"
brew "wxmac"
brew "erlang"
brew "elixir"
brew "elixir-build"
brew "elm"
brew "elm-format"
brew "elvish"
brew "envconsul"
brew "erlang@20"
brew "eslint"
brew "exa"
brew "exercism"
brew "expat"
brew "ext2fuse"
brew "ext4fuse"
brew "ruby"
brew "fastlane"
brew "fd"
brew "fribidi"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "pkg-config"
brew "gobject-introspection"
brew "graphite2"
brew "harfbuzz"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "snappy"
brew "x265"
brew "ffsend"
brew "libmagic"
brew "file-formula"
brew "firebase-cli"
brew "flex"
brew "fluxctl"
brew "fn"
brew "fonttools"
brew "fortio"
brew "fortune"
brew "fping"
brew "fswatch"
brew "libzip"
brew "fuse-zip"
brew "gammu"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gcsfuse"
brew "gd"
brew "gdk-pixbuf"
brew "gdm"
brew "geckodriver"
brew "getdns"
brew "gflags"
brew "ghostscript", link: false
brew "git"
brew "git-credential-manager"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-lfs"
brew "libassuan"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "git-secret"
brew "libssh2"
brew "libgit2"
brew "gitfs"
brew "gitleaks"
brew "gitless"
brew "gitmoji"
brew "glide"
brew "glog"
brew "glooctl"
brew "gnu-sed"
brew "godep"
brew "goenv"
brew "golang-migrate"
brew "google-sparsehash"
brew "gowsdl"
brew "gradle"
brew "gradle-completion"
brew "gsettings-desktop-schemas"
brew "hicolor-icon-theme"
brew "libepoxy"
brew "pango"
brew "gtk+3"
brew "librsvg"
brew "openblas"
brew "numpy"
brew "py3cairo"
brew "pybind11"
brew "pygobject3"
brew "scipy"
brew "graph-tool"
brew "jasper"
brew "netpbm"
brew "gts"
brew "libtool"
brew "graphviz"
brew "gron"
brew "grpcurl"
brew "gssh"
brew "gtk+"
brew "helm"
brew "helm@2"
brew "helmfile"
brew "helmsman"
brew "http-parser"
brew "httpflow"
brew "httpie"
brew "httping"
brew "hub"
brew "hugo"
brew "iamy"
brew "ilmbase"
brew "libde265"
brew "xmlto"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp"
brew "openexr"
brew "imagemagick"
brew "imagemagick@6"
brew "influxdb"
brew "intltool"
brew "zeromq"
brew "ipython"
brew "ispell"
brew "istioctl"
brew "jansson"
brew "jemalloc"
brew "jenkins-job-builder"
brew "oniguruma"
brew "jq"
brew "json-glib"
brew "jsoncpp"
brew "jsonnet"
brew "jsonpp"
brew "pandoc"
brew "jupyterlab"
brew "just"
brew "k3d"
brew "k9s"
brew "kompose"
brew "krb5"
brew "krew"
brew "kube-aws"
brew "kubeaudit"
brew "kubecfg"
brew "kubectx"
brew "kubeless"
brew "kubeprod"
brew "kubespy"
brew "kustomize"
brew "landscaper"
brew "lego"
brew "leiningen"
brew "libb2"
brew "lz4"
brew "zstd"
brew "libarchive"
brew "libcroco"
brew "libelf"
brew "libev"
brew "libewf"
brew "libidn"
brew "libplist"
brew "libusbmuxd"
brew "libimobiledevice"
brew "libkeccak"
brew "libmaxminddb"
brew "libpq"
brew "lzlib"
brew "librdkafka"
brew "libressl"
brew "libsigc++"
brew "libsmi"
brew "libsodium"
brew "libssh"
brew "unibilium"
brew "libtermkey"
brew "libusb-compat"
brew "libuv"
brew "libvterm"
brew "linkerd"
brew "lldpd"
brew "loki"
brew "lorem"
brew "lua@5.1"
brew "luajit"
brew "lynis"
brew "magic-wormhole"
brew "makedepend"
brew "utf8proc"
brew "mame"
brew "mas"
brew "mdcat"
brew "minikube"
brew "protobuf"
brew "mitmproxy"
brew "mkcert"
brew "mmark"
brew "mono", link: false
brew "msgpack"
brew "mussh"
brew "mycli"
brew "mysql-client"
brew "ncftp"
brew "ncurses"
brew "netdata"
brew "newman"
brew "nghttp2"
brew "nginx"
brew "ngs"
brew "node@10"
brew "nspr"
brew "nss", link: false
brew "nuget"
brew "nvm"
brew "ocrmypdf"
brew "openapi-generator"
brew "pkcs11-helper"
brew "openvpn"
brew "operator-sdk"
brew "packer"
brew "packer-completion"
brew "parallel"
brew "pdsh"
brew "perl"
brew "pgcli"
brew "pgformatter"
brew "pidof"
brew "popt"
brew "postgresql", restart_service: true
brew "postgresql@10"
brew "postgresql@9.6"
brew "prips"
brew "procs"
brew "proselint"
brew "protobuf-c"
brew "prototool"
brew "pspg"
brew "pssh"
brew "pth"
brew "pulledpork"
brew "pwgen"
brew "py2cairo"
brew "pyenv"
brew "pyinvoke"
brew "python-yq"
brew "qt"
brew "quicktype"
brew "rakudo-star"
brew "rancher-cli"
brew "rapidjson"
brew "ruby-build"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-binstubs"
brew "rbenv-bundle-exec"
brew "rbenv-bundler-ruby-version"
brew "rbenv-communal-gems"
brew "rbenv-ctags"
brew "rbenv-default-gems"
brew "rbenv-gemset"
brew "rbenv-vars"
brew "rbenv-whatis"
brew "rclone"
brew "re2c"
brew "regina-rexx"
brew "reposurgeon"
brew "rke"
brew "rlwrap"
brew "rmlint"
brew "rocksdb"
brew "rom-tools"
brew "s-lang"
brew "s3cmd"
brew "s3fs"
brew "s3ql"
brew "scons"
brew "scw"
brew "sd"
brew "serverless"
brew "servus"
brew "sha3sum"
brew "shadowenv"
brew "shfmt"
brew "ship"
brew "shmux"
brew "slackcat"
brew "sleuthkit"
brew "socat"
brew "sops"
brew "sourcedocs"
brew "speedtest-cli"
brew "sphinx-doc"
brew "sqlite-analyzer"
brew "sqlmap"
brew "squashfs"
brew "squashfuse"
brew "sslscan"
brew "step"
brew "stern"
brew "stormssh"
brew "stormssh-completion"
brew "stunnel"
brew "supervisor"
brew "swift-sh"
brew "swiftformat"
brew "tbb"
brew "sysdig"
brew "talisman"
brew "telegraf"
brew "terraform"
brew "terraform-docs"
brew "terraform-ls"
brew "terraform@0.11"
brew "terraform_landscape"
brew "terraformer"
brew "terraforming"
brew "terragrunt"
brew "terrahub"
brew "tflint"
brew "thrift"
brew "tmux"
brew "tmuxinator-completion"
brew "topgrade"
brew "tox"
brew "transmission-cli", restart_service: true
brew "trash"
brew "tunnel"
brew "typescript", link: false
brew "unixodbc"
brew "unzip"
brew "uriparser"
brew "vagrant-completion"
brew "vault-cli"
brew "velero"
brew "vfuse"
brew "vsts-cli"
brew "wandio"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "wireshark", link: false
brew "wsk"
brew "wtf"
brew "wtfutil"
brew "xerces-c"
brew "xmlstarlet"
brew "xonsh"
brew "yadm"
brew "yajl"
brew "yamllint"
brew "yara"
brew "ydiff"
brew "yj"
brew "yq", link: false
brew "zabbix-cli"
brew "zeek"
brew "zlib"
brew "zorba"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zurl"
brew "aws/tap/aws-sam-cli"
brew "github/gh/gh"
brew "stripe/stripe-cli/stripe"
brew "ubuntu/microk8s/microk8s"
brew "vapor/tap/ctls"
brew "vapor/tap/vapor"
brew "vapor/tap/vapor-beta"
cask "acorn"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alt-tab"
cask "anki"
cask "authy"
cask "aws-vault"
cask "azure-data-studio"
cask "backblaze"
cask "balenaetcher"
cask "battle-net"
cask "bbedit"
cask "beaker-browser"
cask "bot-framework-emulator"
cask "brave-browser"
cask "cakebrew"
cask "dash"
cask "dat"
cask "discord"
cask "docker"
cask "dotnet"
cask "dropbox"
cask "emacs"
cask "epic-games"
cask "firefox"
cask "fluid"
cask "font-jetbrains-mono"
cask "funter"
cask "google-chrome"
cask "google-cloud-sdk"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "java11"
cask "jetbrains-toolbox"
cask "jupyter-notebook-ql"
cask "jupyter-notebook-viewer"
cask "keybase"
cask "kitematic"
cask "leech"
cask "lens"
cask "maccy"
cask "mactex"
cask "marsedit"
cask "mcedit"
cask "mono-mdk"
cask "moom"
cask "multipass"
cask "netnewswire"
cask "ngrok"
cask "obs"
cask "obs-virtualcam"
cask "obsidian"
cask "oxygen-xml-editor"
cask "postman"
cask "retrobatch"
cask "scrivener"
cask "shotcut"
cask "signal"
cask "sketch"
cask "slack"
cask "smartsynchronize"
cask "soundsource"
cask "sourcetree"
cask "spectacle"
cask "ssh-tunnel-manager"
cask "steam"
cask "strawberry"
cask "superduper"
cask "swiftformat-for-xcode"
cask "tagspaces"
cask "texpad"
cask "transmission"
cask "transmit"
cask "tunnelblick"
cask "unity"
cask "unity-hub"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vlc"
cask "waterfox-current"
cask "wireshark"
cask "zerotier-one"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bible Study", id: 472790630
mas "Fantastical", id: 975937182
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
